Repository: majid-vaghari/toman-interview-task
Catalog: wallet/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Created
fa: ایجاد

source: The date and time when this object was created.
fa: تاریخ و زمان ایجاد این شیء.

source: Updated
fa: به‌روزرسانی

source: The date and time when this object was last updated.
fa: تاریخ و زمان آخرین به‌روزرسانی این شیء.

source: UUID
fa: شناسه

source: A unique identifier for this object.
fa: یک شناسه یکتا برای این شیء.

source: Balance
fa: موجودی

source: The current balance of the wallet.
fa: موجودی فعلی کیف پول.

source: Wallet
fa: کیف پول

source: Wallets
fa: کیف‌های پول

source: The balance must always be positive. Got %(show_value)s.
fa: موجودی باید همیشه مثبت باشد. مقدار دریافت شده %(show_value)s.

source: Pending
fa: در انتظار

source: Success
fa: موفقیت‌آمیز

source: Failed
fa: ناموفق

source: Sender Wallet
fa: فرستنده

source: The wallet from which the transaction is made.
fa: کیف پولی که تراکنش از آن انجام شده است.

source: Receiver Wallet
fa: گیرنده

source: The wallet to which the transaction is made.
fa: کیف پولی که تراکنش به آن انجام شده است.

source: Amount
fa: مقدار

source: The amount of the transaction.
fa: مقدار تراکنش.

source: Scheduled Time
fa: زمان برنامه‌ریزی شده

source: The scheduled time of the transaction.
fa: زمان برنامه‌ریزی شده تراکنش.

source: Status
fa: وضعیت

source: The status of the transaction.
fa: وضعیت تراکنش.

source: Error Message
fa: پیام خطا

source: The error message if the transaction failed.
fa: پیام خطا در صورت ناموفق بودن تراکنش.

source: Transaction
fa: تراکنش

source: Transactions
fa: تراکنش‌ها

source: The amount must be positive. Got %(show_value)s.
fa: مقدار باید مثبت باشد. مقدار دریافت شده %(show_value)s.

source: Sender and receiver cannot be the same.
fa: فرستنده و گیرنده نمی‌توانند یکسان باشند.

source: The amount of the deposit.
fa: مقدار سپرده.

source: The amount of the withdrawal.
fa: مقدار برداشت.

source: The scheduled time of the withdrawal.
fa: زمان برنامه‌ریزی شده برداشت.

source: Target
fa: هدف

source: The wallet to which the withdrawal is made.
fa: کیف پولی که برداشت به آن انجام شده است.

source: You cannot create a withdraw request to yourself.
fa: نمی‌توانید درخواست برداشت به خودتان ایجاد کنید.

source: Transaction cannot be processed before the scheduled time. Try after %(time_remaining)s seconds.
fa: تراکنش نمی‌تواند قبل از زمان‌بندی پردازش شود. پس از %(time_remaining)s ثانیه تلاش کنید.

source: Insufficient funds. Available balance: %(available_balance)s. Required amount: %(required_amount)s.
fa: موجودی ناکافی. موجودی فعلی: %(available_balance)s. مقدار مورد نیاز: %(required_amount)s.

source: Positive value required, got %(show_value)s.
fa: مقدار مثبت مورد نیاز است، مقدار دریافت شده %(show_value)s.

source: Non-negative value required, got %(show_value)s.
fa: مقدار غیر منفی مورد نیاز است، مقدار دریافت شده %(show_value)s.

source: Date must be in the future. Got %(show_value)s. Current time: %(limit_value)s.
fa: تاریخ باید در آینده باشد. مقدار دریافت شده %(show_value)s. زمان فعلی: %(limit_value)s.

source: Date must be at least {seconds} seconds in the future. Got %(show_value)s. Current time: %(limit_value)s.
fa: تاریخ باید حداقل {seconds} ثانیه در آینده باشد. مقدار دریافت شده %(show_value)s. زمان فعلی: %(limit_value)s.
